<template>
    <section class="page-content">
        <h1 class="title">
            Обо мне
        </h1>
        <div class="text-content">
            <p>Доброго дня, меня зовут Саша и я фронтенд-разработчик&nbsp;(прямо клуб анонимных алкоголиков).</p>
            <p>
                Свою профессиональную деятельность я начал в 2016 году. После приезда из армии, никакими знаниями и умениями не
                обладал, а работать нужно. Благо у меня есть друг, который тогда работал в веб-студии "WebDreamTeam", ныне не
                существующей. И вот в феврале того же года, меня пригласили на собеседование&nbsp;(к тому времени, я успел
                подучить верстку, чтобы произвести, хоть какое-то впечатление).&nbsp; Мне дали тестовое задание, от корого у
                меня естественно поплавился мозг (если не ошибаюсь просили сделать простую регистрацию с подтверждением по смс).
                Провозившись с ним в течение 2 дней и 3 ночей, я успешно вошел в ряды сотрудников.
            </p>
            <p>
                Сама работа была не пыльной, конвейерная разработка на WP, никаких стандартов, методологий, и т.п., делай как
                знаешь и умеешь, лишь бы работало. Так пролетело время до декабря, когда произошел оно, а именно банкротство
                организации, что именно произошло в верхушке, мне неизвестно, да и интересовало не сильно. Так под новый год, я
                остался без работы.
            </p>
            <p>
                Начался 2017. Работы нет, а кушать хочется, следовательно нужно искать работу.&nbsp;&nbsp;Во время поисков
                работы, я на себе ощутил, что значит постоянно меняющийся веб, когда ты только-только освоил gulp, а тебя уже
                спрашивают про webpack, на что и остается только пожимать плечами. Так или иначе работу я нашел, но не в офисе,
                а удаленно, в компании "CODE", с ней же поддерживаю сотрудничество до сих пор (привет Илья).
            </p>
            <p>
                Специфика работы сильно не изменилась, только если раньше флагманом был WP, то теперь им стал MODx, верстать в
                админке, конечно то еще извращение).&nbsp;
            </p>
            <p>
                Удаленная работа была для меня в новинку, и резко появился соблазн, оставлять работу на ночь, что впоследствии
                привело к сдвигу режима и появлению разного рода болячек. И так где то в июне, у меня выползли большие проблемы
                со здоровьем, и деятельность пришлось приостановить. Примерно до конца июля я приводил в порядок свое здоровье,
                и опять же встал вопрос о работе (на удаленку возвращаться не хотелось).
            </p>
            <p>
                Так в начале августа меня пригласили на стажировку в компанию "UnitBean", сроком 1 месяц. В вакансии правда
                значились такие штуки как Java и React, если с джавой мне знакомиться совсем не хотелось, то react меня
                интересовал куда больше, но к сожалению прикоснуться к нему у меня не вышло, ибо он использовался на другом
                проекте. А вот с джавой, меня познакомили довольно-таки плотно, но то ли по незнанию, то ли по неумению, она мне
                совсем не приглянулась. Со мной согласился мой древний ноут, который совсем не любил загружать Idea. Также в
                этой компании я впервые столкнулся с полноценной разработкой на гите, что было довольно интересно. Таски в Jira,
                ежедневные митинги, в целом было очень интересно, но ни черта не понятно). Куда интересней было узнать, что я
                буду работать над сайтом Сушивёсел, что заставило меня немного паниковать, кстати мои творения живут на сайте до
                сих пор (чего стоит страница с слайдером видео, которая загружает около сотни метров эхххх).
            </p>
            <p>
                Так или иначе, с джавой я дружить не собирался, и было принято решение, вернуться к родному php. Так успешно
                пройдя стажировку, я отказался на продолжение взял полные карманы и отвалил. Примерно в это же время, со мной
                связались знакомые, с моей 1 работы, и сказали, что открывают свою фирму с блэкдэком и ****ами, так я вернулся
                обратно в родную вордпресс разработку.
            </p>
            <p>
                Стоит отметить, что именно в этот год работы, я впервые столкнулся с таким замечательным инструментом как Vue,
                когда делал калькулятор услуг для компании, что в дальнейшем оказало&nbsp;сильное влияние на мою будущую
                деятельность.
            </p>
            <p>
                Чуть больше года проработав в компании, я решил, что нужно расти дальше, ибо клепать сайты на WP можно до
                старости, и отправился в вольное плаванье, где меня подхватила компания "101 отель".
            </p>
            <p>
                В этой компании началась моя история чистого фронтенда, но не сразу. По прибытию меня сразу же бросили пилить
                новый проект на Yii2, с которым я не сталкивался от слова совсем. Изначальное проект предполагал свзяку php +
                jquery, но через какое то время, было принято решение, добавить щепотку вебпака и перейти на Vue, ибо фронт не
                простой, а опыт изменения 10000-ного джаваскрипта у компании уже был. Позже вспомнили про ssr, что делать как
                быть, решили выводить html через пыху.
            </p>
            <p>
                Прошел год, проект рос, а вместе с ним и я, и в какой-то момент, меня постигло дикое уныние от работы с бэком,
                от чего мне совсем расхотелось работать, о чем я и сообщил руководству. Руководство вошло в мое положение, и
                полностью перевело меня в работу с фронтовой частью и предложило перейти на новый проект в качестве
                джаваскриптизера, с чем я радостно согласился. Проект представлял из себя, новую версию уже имеющейся
                административной панели по управлению отелями, бэк на Symfony, по ресту, все кошерно. Вот здесь я уже полностью
                окунулся во все прелести фронтенда, работа шла на ура, компоненты пилилсь, сторы сторились, роуты роутились. В
                то&nbsp;время меня сильно поразили чанки, что не нужно грузить весь js, а только тот который нужен Вау!
            </p>
            <p>
                Так весело и беззаботно пролетели еще полгода, и пришел он. Учитывая, что бизнес компании это туризм, по
                которому бахнуло очень сильно, а&nbsp;наша админка была еще не готова и&nbsp;ощутимых доходов она бы не
                принесла, руководство&nbsp;приняло решение&nbsp;(к их чести, с неохотой) отправить команду на мороз, до лучших
                времен. Я в целом был этому очень рад, ибо немного&nbsp;устал от разработки и давно хотел сходить в отпуск, хоть
                и само изоляционный.
            </p>
            <p>
                Вдоволь наотдыхавшись, решил вот написать эту&nbsp;историю, чтобы в 1000 раз не отвечать, на вопрос "расскажите
                о себе?".
            </p>
            <p><em>P. S. Не судите строго сайт, сделан за пару дней, чисто для информационной цели.</em></p>
        </div>
    </section>
</template>

<script>

export default {}
</script>

<style lang="scss">

</style>

